## Manipulating Dataframe

In [1]:
import pandas as pd
import numpy as np

In [17]:
df=pd.DataFrame({
'Name':['Sahil Choudhary','Sonia Choudhary','Sourav','Vishal'],
'Age':[10,20,30,40],
'Gender':['M','F','M','M'],
'City':['J','K','L','P'],
'Place of Work':[True,False,False,True]
}
)
df

              Name  Age Gender City  Place of Work
0  Sahil Choudhary   10      M    J           True
1  Sonia Choudhary   20      F    K          False
2           Sourav   30      M    L          False
3           Vishal   40      M    P           True

### Dataframe Inspection

In [18]:
df['Age'].mean()

25.0

In [19]:
df['Age'].sum()

100

In [38]:
df['Name'].unique()

array(['Sahil Choudhary', 'Sonia Choudhary', 'Sourav', 'Vishal'],
      dtype=object)

In [22]:
df['Name'].nunique()

4

In [23]:
df['Name'].value_counts()

Sahil Choudhary    1
Vishal             1
Sonia Choudhary    1
Sourav             1
Name: Name, dtype: int64

### Applying Conditions on columns

#### Condition on one column

In [24]:
df[df['Age']>10]

              Name  Age Gender City  Place of Work
1  Sonia Choudhary   20      F    K          False
2           Sourav   30      M    L          False
3           Vishal   40      M    P           True

#### Name contains Choudhary

In [25]:
df[df['Name'].str.contains('Choudhary')]

              Name  Age Gender City  Place of Work
0  Sahil Choudhary   10      M    J           True
1  Sonia Choudhary   20      F    K          False

#### Condition on multiple columns

In [35]:
df[(df['Age']>10) & (df['Gender']=='M')]  # Note: It won't work if you replace & by and

     Name  Age Gender City  Place of Work
2  Sourav   30      M    L          False
3  Vishal   40      M    P           True

In [37]:
df[df['Age'].between(10,20)]

              Name  Age Gender City  Place of Work
0  Sahil Choudhary   10      M    J           True
1  Sonia Choudhary   20      F    K          False